src/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыКлиентов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыЗаказовКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовКлиентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИнтеграцияAPIСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// REST API (HTTP-сервис API, корневой URL /api).
//
//  GET  /api/v1/stock[?warehouse=<код склада>]  - свободные остатки
//  GET  /api/v1/products                         - номенклатура с действующими ценами
//  POST /api/v1/orders                           - создать и провести заказ клиента
//  GET  /api/v1/orders/{id}                      - заказ с остатками к отгрузке
//
// Все ответы - JSON в UTF-8. Ошибки: {"error": {"code": "...", "message": "...", "details": [...]}}.
// Номенклатура идентифицируется артикулом, склад - кодом, клиент - ИНН, заказ - UUID ссылки.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// GET /api/v1/stock
//
// Параметры:
//  HTTPЗапрос - HTTPСервисЗапрос - входящий запрос.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - {"items": [{"sku", "name", "warehouse", "warehouse_name", "on_hand", "reserved", "available"}]}
//
Функция ПолучитьОстатки(HTTPЗапрос) Экспорт

	КодСклада = HTTPЗапрос.ПараметрыЗапроса.Получить("warehouse");
	Если ЗначениеЗаполнено(КодСклада) Тогда
		Склад = Справочники.Склады.НайтиПоКоду(КодСклада);
		Если Не ЗначениеЗаполнено(Склад) Тогда
			Возврат ОтветОшибка(404, "warehouse_not_found",
				СтрШаблон(НСтр("ru = 'Склад с кодом %1 не найден'"), КодСклада));
		КонецЕсли;
		Склады = Новый Массив;
		Склады.Добавить(Склад);
	Иначе
		Склады = ВсеСклады();
	КонецЕсли;

	// Отбор по складам - в параметрах виртуальных таблиц, чтобы СУБД не читала лишние остатки.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склады", Склады);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.Номенклатура.Артикул КАК Артикул,
	|	Остатки.Номенклатура.Наименование КАК Наименование,
	|	Остатки.Склад.Код КАК КодСклада,
	|	Остатки.Склад.Наименование КАК НаименованиеСклада,
	|	СУММА(Остатки.ВНаличии) КАК ВНаличии,
	|	СУММА(Остатки.ВРезерве) КАК ВРезерве
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТоварыНаСкладах.Номенклатура КАК Номенклатура,
	|		ТоварыНаСкладах.Склад КАК Склад,
	|		ТоварыНаСкладах.КоличествоОстаток КАК ВНаличии,
	|		0 КАК ВРезерве
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад В (&Склады)) КАК ТоварыНаСкладах
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТоварыВРезерве.Номенклатура,
	|		ТоварыВРезерве.Склад,
	|		0,
	|		ТоварыВРезерве.КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезерве.Остатки(, Склад В (&Склады)) КАК ТоварыВРезерве) КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.Номенклатура.Артикул,
	|	Остатки.Номенклатура.Наименование,
	|	Остатки.Склад.Код,
	|	Остатки.Склад.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	НаименованиеСклада,
	|	Наименование";

	Позиции = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Позиция = Новый Структура;
		Позиция.Вставить("sku", Выборка.Артикул);
		Позиция.Вставить("name", Выборка.Наименование);
		Позиция.Вставить("warehouse", Выборка.КодСклада);
		Позиция.Вставить("warehouse_name", Выборка.НаименованиеСклада);
		Позиция.Вставить("on_hand", Выборка.ВНаличии);
		Позиция.Вставить("reserved", Выборка.ВРезерве);
		Позиция.Вставить("available", Выборка.ВНаличии - Выборка.ВРезерве);
		Позиции.Добавить(Позиция);
	КонецЦикла;

	Возврат ОтветJSON(200, Новый Структура("items", Позиции));

КонецФункции

// GET /api/v1/products
//
// Параметры:
//  HTTPЗапрос - HTTPСервисЗапрос - входящий запрос.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - {"items": [{"sku", "name", "type", "unit", "price"}]}
//
Функция ПолучитьНоменклатуру(HTTPЗапрос) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныСрез.Номенклатура КАК Номенклатура,
	|	ЦеныСрез.Цена КАК Цена
	|ПОМЕСТИТЬ ВТЦены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ) КАК ЦеныСрез
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Наименование КАК Наименование,
	|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ВТЦены.Цена, 0) КАК Цена
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦены КАК ВТЦены
	|		ПО Номенклатура.Ссылка = ВТЦены.Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|	И Номенклатура.Артикул <> """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование";

	Позиции = Новый Массив;
	Выборка = Запрос.ВыполнитьПакет()[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Позиция = Новый Структура;
		Позиция.Вставить("sku", Выборка.Артикул);
		Позиция.Вставить("name", Выборка.Наименование);
		Позиция.Вставить("type", ?(Выборка.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга,
			"service", "goods"));
		Позиция.Вставить("unit", Выборка.ЕдиницаИзмерения);
		Позиция.Вставить("price", Выборка.Цена);
		Позиции.Добавить(Позиция);
	КонецЦикла;

	Возврат ОтветJSON(200, Новый Структура("items", Позиции));

КонецФункции

// POST /api/v1/orders
// Тело: {"customer_inn": "...", "warehouse": "<код>", "shipment_date": "YYYY-MM-DD",
//        "reserve": true, "comment": "...", "items": [{"sku": "...", "quantity": 1, "price": 100}]}
// Поле price необязательное - по умолчанию берется действующая цена.
//
// Параметры:
//  HTTPЗапрос - HTTPСервисЗапрос - входящий запрос.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - 201 и представление заказа; 400 - ошибка формата; 422 - заказ не проведен.
//
Функция СоздатьЗаказ(HTTPЗапрос) Экспорт

	Тело = ПрочитатьТелоJSON(HTTPЗапрос);
	Если Тело = Неопределено Тогда
		Возврат ОтветОшибка(400, "invalid_json", НСтр("ru = 'Тело запроса должно быть JSON-объектом'"));
	КонецЕсли;

	Ошибки = Новый Массив;
	Заказ = РазобратьЗаказ(Тело, Ошибки);
	Если Ошибки.Количество() > 0 Тогда
		Возврат ОтветОшибка(400, "validation_failed", НСтр("ru = 'Запрос содержит ошибки'"), Ошибки);
	КонецЕсли;

	ЗаказОбъект = Документы.ЗаказКлиента.СоздатьДокумент();
	ЗаказОбъект.Дата = ТекущаяДатаСеанса();
	ЗаказОбъект.Заполнить(Неопределено);
	ЗаказОбъект.Контрагент = Заказ.Контрагент;
	ЗаказОбъект.Склад = Заказ.Склад;
	ЗаказОбъект.ДатаОтгрузки = Заказ.ДатаОтгрузки;
	ЗаказОбъект.Статус = ?(Заказ.Резервировать, Перечисления.СтатусыЗаказовКлиентов.КОтгрузке,
		Перечисления.СтатусыЗаказовКлиентов.Новый);
	ЗаказОбъект.Комментарий = Заказ.Комментарий;
	Для Каждого Позиция Из Заказ.Товары Цикл
		ЗаполнитьЗначенияСвойств(ЗаказОбъект.Товары.Добавить(), Позиция);
	КонецЦикла;

	ОбщегоНазначения.ЗабратьСообщенияПользователю();
	Попытка
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Причины = ОбщегоНазначения.ЗабратьСообщенияПользователю();
		Если Не ЗначениеЗаполнено(Причины) Тогда
			Причины = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецЕсли;
		Возврат ОтветОшибка(422, "order_not_posted", НСтр("ru = 'Заказ не может быть проведен'"),
			СтрРазделить(Причины, Символы.ПС, Ложь));
	КонецПопытки;

	Ответ = ОтветJSON(201, ПредставлениеЗаказа(ЗаказОбъект.Ссылка));
	Ответ.Заголовки.Вставить("Location", "/api/v1/orders/" + Строка(ЗаказОбъект.Ссылка.УникальныйИдентификатор()));
	Возврат Ответ;

КонецФункции

// GET /api/v1/orders/{id}
//
// Параметры:
//  HTTPЗапрос - HTTPСервисЗапрос - входящий запрос.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - представление заказа или 404.
//
Функция ПолучитьЗаказ(HTTPЗапрос) Экспорт

	Идентификатор = HTTPЗапрос.ПараметрыURL.Получить("id");
	Попытка
		УИД = Новый УникальныйИдентификатор(Идентификатор);
	Исключение
		Возврат ОтветОшибка(400, "invalid_id", НСтр("ru = 'Идентификатор заказа должен быть UUID'"));
	КонецПопытки;

	Ссылка = Документы.ЗаказКлиента.ПолучитьСсылку(УИД);
	Если Не ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Возврат ОтветОшибка(404, "order_not_found", НСтр("ru = 'Заказ не найден'"));
	КонецЕсли;

	Возврат ОтветJSON(200, ПредставлениеЗаказа(Ссылка));

КонецФункции

// Ответ 500 на непредвиденное исключение. Подробности пишутся в журнал регистрации,
// клиенту уходит только краткое описание.
//
// Параметры:
//  ИнформацияОбОшибке - ИнформацияОбОшибке - описание исключения.
//
// Возвращаемое значение:
//  HTTPСервисОтвет - ответ с кодом 500.
//
Функция ОтветВнутренняяОшибка(ИнформацияОбОшибке) Экспорт

	ЗаписьЖурналаРегистрации(НСтр("ru = 'REST API'", "ru"), УровеньЖурналаРегистрации.Ошибка, , ,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	Возврат ОтветОшибка(500, "internal_error", ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Заказы

// Проверяет тело запроса на создание заказа и сопоставляет его с данными базы.
// Все найденные ошибки добавляются в массив Ошибки (не останавливаемся на первой).
//
// Параметры:
//  Тело - Соответствие - JSON-объект запроса.
//  Ошибки - Массив из Строка - сюда добавляются описания ошибок.
//
// Возвращаемое значение:
//  Структура - Контрагент, Склад, ДатаОтгрузки, Резервировать, Комментарий, Товары.
//
Функция РазобратьЗаказ(Тело, Ошибки)

	Заказ = Новый Структура("Контрагент, Склад, ДатаОтгрузки, Резервировать, Комментарий, Товары");

	ИНН = Тело.Получить("customer_inn");
	Если ТипЗнч(ИНН) <> Тип("Строка") Или Не ЗначениеЗаполнено(ИНН) Тогда
		Ошибки.Добавить("customer_inn: обязательное строковое поле");
	Иначе
		Заказ.Контрагент = Справочники.Контрагенты.НайтиПоИНН(ИНН);
		Если Не ЗначениеЗаполнено(Заказ.Контрагент) Тогда
			Ошибки.Добавить(СтрШаблон("customer_inn: клиент с ИНН %1 не найден", ИНН));
		КонецЕсли;
	КонецЕсли;

	КодСклада = Тело.Получить("warehouse");
	Если ТипЗнч(КодСклада) <> Тип("Строка") Или Не ЗначениеЗаполнено(КодСклада) Тогда
		Заказ.Склад = Константы.ОсновнойСклад.Получить();
		Если Не ЗначениеЗаполнено(Заказ.Склад) Тогда
			Ошибки.Добавить("warehouse: не указан, а основной склад не задан");
		КонецЕсли;
	Иначе
		Заказ.Склад = Справочники.Склады.НайтиПоКоду(КодСклада);
		Если Не ЗначениеЗаполнено(Заказ.Склад) Тогда
			Ошибки.Добавить(СтрШаблон("warehouse: склад с кодом %1 не найден", КодСклада));
		КонецЕсли;
	КонецЕсли;

	ДатаОтгрузки = Тело.Получить("shipment_date");
	Если ДатаОтгрузки = Неопределено Тогда
		Заказ.ДатаОтгрузки = НачалоДня(ТекущаяДатаСеанса()) + 86400;
	Иначе
		Заказ.ДатаОтгрузки = ДатаИзСтрокиISO(ДатаОтгрузки);
		Если Заказ.ДатаОтгрузки = Неопределено Тогда
			Ошибки.Добавить("shipment_date: ожидается дата в формате YYYY-MM-DD");
		КонецЕсли;
	КонецЕсли;

	Резервировать = Тело.Получить("reserve");
	Заказ.Резервировать = (Резервировать = Неопределено Или Резервировать = Истина);

	Комментарий = Тело.Получить("comment");
	Заказ.Комментарий = ?(ТипЗнч(Комментарий) = Тип("Строка"), Комментарий, "");

	Заказ.Товары = Новый Массив;
	Позиции = Тело.Получить("items");
	Если ТипЗнч(Позиции) <> Тип("Массив") Или Позиции.Количество() = 0 Тогда
		Ошибки.Добавить("items: нужен непустой массив позиций");
		Возврат Заказ;
	КонецЕсли;

	Для Индекс = 0 По Позиции.ВГраница() Цикл
		Заказ.Товары.Добавить(РазобратьПозицию(Позиции[Индекс], Индекс, Ошибки));
	КонецЦикла;

	Возврат Заказ;

КонецФункции

Функция РазобратьПозицию(Позиция, Индекс, Ошибки)

	Результат = Новый Структура("Номенклатура, Количество, Цена", Неопределено, 0, 0);
	Префикс = СтрШаблон("items[%1]", Формат(Индекс, "ЧН=0; ЧГ=0"));

	Если ТипЗнч(Позиция) <> Тип("Соответствие") Тогда
		Ошибки.Добавить(Префикс + ": ожидается объект");
		Возврат Результат;
	КонецЕсли;

	Артикул = Позиция.Получить("sku");
	Если ТипЗнч(Артикул) <> Тип("Строка") Или Не ЗначениеЗаполнено(Артикул) Тогда
		Ошибки.Добавить(Префикс + ".sku: обязательное строковое поле");
	Иначе
		Результат.Номенклатура = Справочники.Номенклатура.НайтиПоАртикулу(Артикул);
		Если Не ЗначениеЗаполнено(Результат.Номенклатура) Тогда
			Ошибки.Добавить(СтрШаблон("%1.sku: номенклатура с артикулом %2 не найдена", Префикс, Артикул));
		КонецЕсли;
	КонецЕсли;

	Количество = Позиция.Получить("quantity");
	Если ТипЗнч(Количество) <> Тип("Число") Или Количество <= 0 Тогда
		Ошибки.Добавить(Префикс + ".quantity: нужно положительное число");
	Иначе
		Результат.Количество = Количество;
	КонецЕсли;

	Цена = Позиция.Получить("price");
	Если Цена <> Неопределено Тогда
		Если ТипЗнч(Цена) <> Тип("Число") Или Цена < 0 Тогда
			Ошибки.Добавить(Префикс + ".price: нужно неотрицательное число");
		Иначе
			Результат.Цена = Цена;
		КонецЕсли;
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция ПредставлениеЗаказа(Ссылка)

	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
		"Номер, Дата, Статус, Контрагент, Склад, ДатаОтгрузки, СуммаДокумента, Комментарий");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Номенклатура.Артикул КАК Артикул,
	|	Товары.Номенклатура.Наименование КАК Наименование,
	|	СУММА(Товары.Количество) КАК Количество,
	|	СУММА(Товары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура,
	|	Товары.Номенклатура.Артикул,
	|	Товары.Номенклатура.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыОстатки.КоличествоОстаток КАК КОтгрузке
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов.Остатки(, ЗаказКлиента = &Ссылка) КАК ЗаказыОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Артикул КАК Артикул,
	|	ВТТовары.Наименование КАК Наименование,
	|	ВТТовары.Количество КАК Количество,
	|	ВТТовары.Сумма КАК Сумма,
	|	ЕСТЬNULL(ВТОстатки.КОтгрузке, 0) КАК КОтгрузке
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК ВТОстатки
	|		ПО ВТТовары.Номенклатура = ВТОстатки.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Отгружено = Документы.ЗаказКлиента.ИспользованоПоЗаказу(Ссылка).Отгружено;

	Позиции = Новый Массив;
	Выборка = Запрос.ВыполнитьПакет()[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		Позиция = Новый Структура;
		Позиция.Вставить("sku", Выборка.Артикул);
		Позиция.Вставить("name", Выборка.Наименование);
		Позиция.Вставить("quantity", Выборка.Количество);
		Позиция.Вставить("amount", Выборка.Сумма);
		Позиция.Вставить("shipped", ОтгруженоПоАртикулу(Отгружено, Выборка.Артикул));
		Позиция.Вставить("remaining", Выборка.КОтгрузке);
		Позиции.Добавить(Позиция);
	КонецЦикла;

	Результат = Новый Структура;
	Результат.Вставить("id", Строка(Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("number", Реквизиты.Номер);
	Результат.Вставить("date", XMLСтрока(Реквизиты.Дата));
	Результат.Вставить("status", КодСтатуса(Реквизиты.Статус));
	Результат.Вставить("customer", Строка(Реквизиты.Контрагент));
	Результат.Вставить("warehouse", Строка(Реквизиты.Склад));
	Результат.Вставить("shipment_date", Формат(Реквизиты.ДатаОтгрузки, "ДФ=yyyy-MM-dd"));
	Результат.Вставить("total", Реквизиты.СуммаДокумента);
	Результат.Вставить("comment", Реквизиты.Комментарий);
	Результат.Вставить("items", Позиции);

	Возврат Результат;

КонецФункции

Функция ОтгруженоПоАртикулу(Отгружено, Артикул)

	Итого = 0;
	Для Каждого СтрокаОтгрузки Из Отгружено Цикл
		Если СтрокаОтгрузки.Номенклатура.Артикул = Артикул Тогда
			Итого = Итого + СтрокаОтгрузки.Количество;
		КонецЕсли;
	КонецЦикла;
	Возврат Итого;

КонецФункции

Функция КодСтатуса(Статус)

	Если Статус = Перечисления.СтатусыЗаказовКлиентов.КОтгрузке Тогда
		Код = "to_ship";
	ИначеЕсли Статус = Перечисления.СтатусыЗаказовКлиентов.Закрыт Тогда
		Код = "closed";
	Иначе
		Код = "new";
	КонецЕсли;
	Возврат Код;

КонецФункции

#КонецОбласти

#Область JSON

Функция ПрочитатьТелоJSON(HTTPЗапрос)

	Текст = HTTPЗапрос.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Чтение = Новый ЧтениеJSON;
	Попытка
		Чтение.УстановитьСтроку(Текст);
		Данные = ПрочитатьJSON(Чтение, Истина);
		Чтение.Закрыть();
	Исключение
		Возврат Неопределено;
	КонецПопытки;

	Возврат ?(ТипЗнч(Данные) = Тип("Соответствие"), Данные, Неопределено);

КонецФункции

Функция ОтветJSON(КодСостояния, Данные)

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет));
	ЗаписатьJSON(Запись, Данные);

	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(Запись.Закрыть(), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

КонецФункции

Функция ОтветОшибка(КодСостояния, КодОшибки, Сообщение, Подробности = Неопределено)

	Ошибка = Новый Структура("code, message", КодОшибки, Сообщение);
	Если Подробности <> Неопределено Тогда
		Ошибка.Вставить("details", Подробности);
	КонецЕсли;
	Возврат ОтветJSON(КодСостояния, Новый Структура("error", Ошибка));

КонецФункции

// Разбирает дату формата YYYY-MM-DD.
//
// Параметры:
//  Значение - Произвольный - значение из JSON.
//
// Возвращаемое значение:
//  Дата, Неопределено - дата или Неопределено, если формат неверный.
//
Функция ДатаИзСтрокиISO(Значение)

	Если ТипЗнч(Значение) <> Тип("Строка") Или СтрДлина(Значение) <> 10
		Или Сред(Значение, 5, 1) <> "-" Или Сред(Значение, 8, 1) <> "-" Тогда
		Возврат Неопределено;
	КонецЕсли;

	ТолькоЦифры = Лев(Значение, 4) + Сред(Значение, 6, 2) + Сред(Значение, 9, 2);
	Для Позиция = 1 По СтрДлина(ТолькоЦифры) Цикл
		Если СтрНайти("0123456789", Сред(ТолькоЦифры, Позиция, 1)) = 0 Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЦикла;

	// Дата сама проверит допустимость дня в месяце (например, 2026-02-30).
	Результат = Неопределено;
	Попытка
		Результат = Дата(ТолькоЦифры + "000000");
	Исключение
		Результат = Неопределено;
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Возвращает все не помеченные на удаление склады.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.Склады - склады.
//
Функция ВсеСклады()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ПометкаУдаления";

	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции

#КонецОбласти

#КонецОбласти
